<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Albert World</title>
  <icon>https://www.gravatar.com/avatar/8ccc6291d5bfd34e7aaf601c4ebec7e1</icon>
  
  <link href="/blog/atom.xml" rel="self"/>
  
  <link href="http://AlbertGithubHome.github.io/blog/"/>
  <updated>2020-05-17T03:22:00.538Z</updated>
  <id>http://AlbertGithubHome.github.io/blog/</id>
  
  <author>
    <name>Albert Shi</name>
    <email>347070901@qq.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>使用c++filt命令还原C++编译后的函数名</title>
    <link href="http://AlbertGithubHome.github.io/blog/2020/05/16/%E4%BD%BF%E7%94%A8c-filt%E5%91%BD%E4%BB%A4%E8%BF%98%E5%8E%9FC-%E7%BC%96%E8%AF%91%E5%90%8E%E7%9A%84%E5%87%BD%E6%95%B0%E5%90%8D/"/>
    <id>http://AlbertGithubHome.github.io/blog/2020/05/16/使用c-filt命令还原C-编译后的函数名/</id>
    <published>2020-05-16T13:22:43.000Z</published>
    <updated>2020-05-17T03:22:00.538Z</updated>
    

    <content type="html"><![CDATA[<h1 id="前言"><a href="#前言" class="headerlink" title="前言"></a>前言</h1><p>最近被问到一个关于多继承虚函数表的问题，当时回答是可能存在多个虚函数表，应该是顺序排列的，但具体怎么排列还是有些疑惑的，回答的时候到有点儿心虚。之后查了资料，做了简单的实验，可以确定的是对于继承了多个含有虚函数基类的子类来说，指向虚函数表的指针应该不止一个。</p><a id="more"></a><h1 id="问题"><a href="#问题" class="headerlink" title="问题"></a>问题</h1><p>虚函数表的问题是从C++多态的概念引出的，要想实现多态有3个条件：</p><ol><li>存在继承：没有继承就没有多态（运行时），在多态中必须存在有继承关系的父类和子类。</li><li>重写函数：父类中需要定义带有 <code>virtual</code> 关键字的函数，而在子类中重写一个名字和参数与父类中定义完全相同的函数。</li><li>向上转型：将父类的指针和引用指向子类的对象。</li></ol><p>满足以上三个条件，当使用父类的指针调用带有 <code>virtual</code> 关键字的函数时，就会产生多态行为。</p><p>实现这种多态表现的核心内容就是虚函数表，对于带有 <code>virtual</code> 关键字的函数地址会被放入一个表格，而在类中会有一个指向虚函数表的指针指向这个表格，表明这个表格属于类的一部分。</p><p>对于父类来说，这个表格中都是自己类的虚函数，而对于子类来说，首先这个虚函数表包含父类中所有的虚函数，当子类重写某个虚函数时就会用子类重写后的函数地址替换原来父类中定义的函数地址，同时在子类的虚函数表中还会包含子类独有的虚函数。</p><p>由此可见虚函数表的不同和复杂性还是体现在子类上，所以之后会分别测试单继承、多继承、菱形继承三种情况下虚函数表的不同，主要看一下虚函数表的个数和内存布局情况。</p><h1 id="测试环境"><a href="#测试环境" class="headerlink" title="测试环境"></a>测试环境</h1><p>首先来说明一下测试环境，测试工具是<code>VS2013</code>，对于<code>int *p; sizeof(p)</code>的结果是4，说明编译环境是32位的，这个对后面查看内存结构非常关键。</p><h1 id="开始测试"><a href="#开始测试" class="headerlink" title="开始测试"></a>开始测试</h1><p>使用VS2013查看类的内存布局非常方便，因为类的大小在编译期间就已经确定了，不用运行就可以通过添加编译选项知道类的大小和布局，而指向虚函数表的指针也会占用类的大小，如果说编译的时候确定了类的大小，那从侧面也说明了在编译期间虚函数表实际上也确定了。</p><p>使用VS2013查看类的布局时，可以在项目的属性页：“配置属性”–&gt;“C/C++”–&gt;“命令行”中输入以下任意一个命令，</p><ul><li><code>/d1reportAllClassLayout</code> ：这个选项可以在VS的输出窗口显示所有相关联的类结构，因为一些外部类也会显示，最终的内容会非常多，需要自己辨别有用的信息。</li><li><code>/d1reportSingleClassLayoutXXX</code> ：这个选项只会在输出窗口显示指定的类结构，只需要将<code>XXX</code>替换成想显示的类的名字即可，缺点就是无法同时显示多个想查看的类。</li></ul><h2 id="无虚函数简单类结构"><a href="#无虚函数简单类结构" class="headerlink" title="无虚函数简单类结构"></a>无虚函数简单类结构</h2><p>在查看虚函数表的结构之前，先使用之前的编译参数来查看一下简单的类结构，排除虚函数的干扰，能更清楚的了解类成员在类中的布局情况，有一点需要提一下，成员变量会占用类的大小，但是成员函数不会，如果有虚函数，所有的虚函数会被放入一个表格，而在类中放置一个指向虚函数表的指针，来看一下简单代码：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var1;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CDerived</span> :</span> <span class="keyword">public</span> CBase</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var2;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>编译输出的类的内存布局为：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class CBase    size(4):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CDerived  size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var2</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br></pre></td></tr></table></figure><p>从上面的输出内容来看，很清楚的可以看到基类 <code>CBase</code> 的大小 <code>size(4)</code> 占用4个字节，只有一个成员变量 <code>m_var1</code>，在类中偏移量为0的位置，而派生类 <code>CDerived</code> 占用8个字节大小，第一个成员继承自基类 <code>CBase</code> 的 <code>m_var1</code>，在类中偏移量为0的位置，还有一个子类独有的成员变量 <code>m_var2</code>，在类中偏移量为4的位置。</p><p>掌握着这种简单类的查看类结构的方法，接下来开始看一下包含虚函数的类的内存布局。</p><h2 id="包含虚函数的类结构"><a href="#包含虚函数的类结构" class="headerlink" title="包含虚函数的类结构"></a>包含虚函数的类结构</h2><p>查看包含虚函数的类结构相对来说麻烦一点，先来说两个符号，免得一会看见结构发懵，<code>vfptr</code> 表示类中指向虚函数表的指针，通常放在类的起始位置，比成员变量的位置都要靠前， <code>vftable</code> 表示类中引用的虚函数表，在具体分析是还有有一些修饰符，用来表明是谁的虚函数表。</p><h3 id="单继承"><a href="#单继承" class="headerlink" title="单继承"></a>单继承</h3><p>这种情况的下的子类的虚函数表很简单，在该子类的内存布局上，最开始的位置保存了一个指向虚函数表的指针，虚函数表中包含了从父类继承的虚函数，当子类中重写父类虚函数时会将虚函数表中对应的函数地址替换，最后添加上自己独有的虚函数地址，下面上代码分析一下：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func0</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var1;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CDerived</span> :</span> <span class="keyword">public</span> CBase</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var2;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>上面这两个类的内存布局情况如下：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class CBase size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CBase_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CBase::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase::func2</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CDerived  size(12):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | m_var2</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CDerived_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CBase::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CDerived::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CDerived::func3</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func3 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br></pre></td></tr></table></figure><p>看起来是不是比没有虚函数时复杂多了，不过不要着急，从上到下慢慢分析就好了，这次的基类 <code>CBase</code> 大小是8个字节，首先是<code>{vfptr}</code>这个指向虚函数表的指针，在类中的偏移量是0，接下来是成员变量 <code>m_var1</code>，在类中偏移量是4。</p><p>然后是 <code>CBase::$vftable@</code> 表示基类 <code>CBase</code> 的虚函数表，其中第一行 <code>&amp;CBase_meta</code> 看起来怪怪的，这里我们不展开（因为我也没弄太懂），应该是和虚函数表相关的元数据，第二行是一个0，看起来是一个偏移量，这里没有偏移，当出现偏移时我们再试着分析（相信我，马上就会出现），第三行内容 <code>&amp;CBase::func1</code> 是自己类的虚函数，前面有一个0，应该是指该虚函数在虚函数表中索引，第四行也是相同的情况。</p><p>接下来出现了两行非常相似的内容，看一下<code>CBase::func1 this adjustor: 0</code>，这句代码中的关键是 <code>adjustor</code>，其实有是一个偏移量，据说涉及到thunk技术，据说“thunk其实就是一条汇编指令，操作码是0xe9，就是jmp，后面紧跟操作数”，这里我们就不展开了，如果后面弄明白了可以单独写一篇总结，到此为止基类的内存结构就分析完了。</p><p>继续看派生类 <code>CDerived</code>，它的大小是12个字节，内部结构首先是 <code>{vfptr}</code> 一个指向虚函数表的指针，偏移量为0，<code>m_var1</code> 是从父类继承的成员变量，偏移量为4，而 <code>m_var2</code> 是自己类独有的成员变量，偏移量是8。</p><p>然后看派生类对应的虚函数表 <code>CDerived::$vftable@</code>，跳过前两行直接看一下后面几个函数，发现只有 <code>func1</code> 是基类的，而函数 <code>func2</code> 和 <code>func3</code> 都是派生类的，出现这种情况的原因是子类重写了函数 <code>func2</code> 和 <code>func3</code> ，所以用重写后的函数地址替换了从基类继承的虚函数，造成了目前看到的状况。</p><p>最后又出现了两行 <code>adjustor</code>，很奇怪为什么 <code>func1</code> 函数没有 <code>adjustor</code>，貌似这个 <code>adjustor</code> 只对当前类有效，先留个疑问，接下来看一下多继承。</p><h3 id="多继承"><a href="#多继承" class="headerlink" title="多继承"></a>多继承</h3><p>当多个父类中都包含虚函数的时候，和子类关联的虚函数表就不止一个了，这个情况是可以通过使用sizeof(子类)来简单验证的：</p><p>这一部分是在没有VS的情况下预先写下的，本来考虑使用VS展开布局后，这一段就没有什么必要了，但是后来想想还是留着吧，因为这一段使用的g++编译器，64位环境，每个指针占用8个字节，通过不同的环境调试，更加可以证明，多继承下的多个虚函数表的存在性：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">W</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">long</span> n;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>对于这样的一个简单类，sizeof(W) = 8，类的大小等于成员变量的大小。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">W1</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">long</span> n1;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">W2</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">long</span> n2;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>对于上面这两个简单的包含虚函数的类，sizeof(W1) = 16，sizeof(W2) = 16，因为每个类都除了一个 <code>long</code> 类型的成员变量以外，还包含了指向虚函数的一个指针，所以类的大小是16个字节。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">WW</span> :</span> <span class="keyword">public</span> W1, <span class="keyword">public</span> W2</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">long</span> nn;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>而继承了 <code>W1</code> 和 <code>W2</code> 这两个父类的子类 <code>WW</code> 在继承了两个成员变量 <code>n1</code> 和 <code>n2</code> 之外，还有自己的成员变量 <code>nn</code>，三个变量占用字节24个，而计算类 <code>WW</code> 的的大小 sizeof(W1) = 40，也就是说除了成员变量24个字节，还剩余了16个字节的空间没有着落，我们知道它至少包含一个指向虚函数表的指针，占用8个字节的大小，还剩8个字节没有找到用处，从此处分析应该还有一个指向虚函数表的指针，具体的情况可以看一下内存分布。</p><p>接下来和单继承的分析方法一样，写代码编译查看布局：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase0</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func0</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var0;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase1</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func0</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var1;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CDerived</span> :</span> <span class="keyword">public</span> CBase0, <span class="keyword">public</span> CBase1</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func5</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">func6</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var2;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>上面3个类描述了一个简单的多继承的情况，之所以写这么多函数就是构建一种，既有虚函数覆盖，又有单独不被覆盖的情况，下面展示了这段代码的内存布局。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class CBase0    size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var0</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase0::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CBase0_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CBase0::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase0::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase0::func3</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase0::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase0::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase0::func3 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CBase1    size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase1::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CBase1_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CBase1::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase1::func3</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase1::func4</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase1::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase1::func3 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase1::func4 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CDerived  size(20):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase0)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | | m_var0</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase1)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">12</span>  | | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">16</span>  | m_var2</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::$vftable@CBase0@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CDerived_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CDerived::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CDerived::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase0::func3</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">3</span>  | &amp;CDerived::func5</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::$vftable@CBase1@:</span><br><span class="line"><span class="number">1</span>&gt;      | <span class="number">-8</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;thunk: <span class="keyword">this</span>-=<span class="number">8</span>; <span class="keyword">goto</span> CDerived::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase1::func3</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CDerived::func4</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func4 <span class="keyword">this</span> adjustor: <span class="number">8</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func5 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br></pre></td></tr></table></figure><p>内容很多，前面两个基类 <code>CBase0</code> 和 <code>CBase1</code> 的布局很简单，参照之前的分析很容易看懂，直接从派生类看起吧。</p><p>我们发现派生类 <code>CDerived</code> 中确实有两个指向虚函数表的指针，接下来看一下这两个虚函数表，这个虚函数表和前面遇到的格式一样，除了第一行的元数据，第二行的诡异偏移量0，剩下的虚函数指针有的是从基类继承来的，有的是被当前派生类覆盖的，还有派生类自己独有的。</p><p>而第二个虚函数表就有点意思了，首先是少了 <code>&amp;CDerived_meta</code> 这一行，然后偏移量终于不是0了，而是-8，从派生类 <code>CDerived</code> 的内存布局上来看，以下开始大胆假设，至于小心求证的部分放到以后来做（看自己的进步状态了）。</p><p>第二个指向虚函数表的指针是不是距离类的起始偏移量是8，我猜这个-8的意思就是指的这个偏移量，这个值有可能被后面使用，第二行出现了 <code>&amp;thunk: this-=8; goto CDerived::func2</code>，其中包含 <code>thunk</code> 字样，表示这个 <code>func2</code> 不归我管，你去-8偏移量的那个虚函数表里找一找。</p><p>还有一点你有没有发现 <code>func5</code> 这个函数只在第一个虚函数表中出现，而没有出现在第二个虚函数表中，这也是一个规则，自己独有的虚函数放到第一个虚函数表中，这可能也是为什么只有第一个虚函数表包含元数据行。</p><p>最后一点，我们发现对于函数 <code>func4</code> 来说 <code>adjustor</code> 终于不是0了，而值变成了8，仿佛在说这个虚函数只在偏移量的为8的位置。</p><h3 id="菱形继承"><a href="#菱形继承" class="headerlink" title="菱形继承"></a>菱形继承</h3><p>对于这一部分，并没有太多新的内容，只是简单的菱形继承中，最初的基类在最终的子类中会包含两份，而虚函数的样子并没有太大的不同，接下来简单看一下代码和对应的内存布局即可，因为菱形继承并不被提倡，所以也不用花太多时间来分析这个问题。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CSuper</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func0</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase0</span> :</span> <span class="keyword">public</span> CSuper</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var0;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase1</span> :</span> <span class="keyword">public</span> CSuper</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var1;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CDerived</span> :</span> <span class="keyword">public</span> CBase0, <span class="keyword">public</span> CBase1</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var2;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class CSuper    size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CSuper::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CSuper_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CSuper::func1</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CSuper::func0 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CSuper::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CBase0    size(12):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CSuper)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | | m_var</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | m_var0</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase0::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CBase0_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase0::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase0::func2</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase0::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase0::func2 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CBase1    size(12):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CSuper)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | | m_var</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase1::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CBase1_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CBase1::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase1::func3</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CBase1::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CBase1::func3 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CDerived  size(28):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase0)</span><br><span class="line"><span class="number">1</span>&gt;      | | +--- (base class CSuper)</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | | | m_var</span><br><span class="line"><span class="number">1</span>&gt;      | | +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | | m_var0</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;      | +--- (base class CBase1)</span><br><span class="line"><span class="number">1</span>&gt;      | | +--- (base class CSuper)</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">12</span>  | | | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">16</span>  | | | m_var</span><br><span class="line"><span class="number">1</span>&gt;      | | +---</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">20</span>  | | m_var1</span><br><span class="line"><span class="number">1</span>&gt;      | +---</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">24</span>  | m_var2</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::$vftable@CBase0@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CDerived_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CDerived::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CBase0::func2</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">3</span>  | &amp;CDerived::func4</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::$vftable@CBase1@:</span><br><span class="line"><span class="number">1</span>&gt;      | <span class="number">-12</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;thunk: <span class="keyword">this</span>-=<span class="number">12</span>; <span class="keyword">goto</span> CDerived::func1</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">2</span>  | &amp;CDerived::func3</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func3 <span class="keyword">this</span> adjustor: <span class="number">12</span></span><br><span class="line"><span class="number">1</span>&gt;  CDerived::func4 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br></pre></td></tr></table></figure><h3 id="虚继承"><a href="#虚继承" class="headerlink" title="虚继承"></a>虚继承</h3><p>解决菱形继承的一个常用的办法就是改为虚继承，实际上虚继承中就是将从最基类中继承的公共部分提取出来放在最子类的末尾，然后在提取之前的位置用一个叫做<code>vbptr</code>的指针指向这里。</p><p>之前看到过一种说法：</p><blockquote><p>虚继承内部实现也相当复杂，似乎破坏了OO的纯洁性</p></blockquote><p>至于复杂不复杂，看看后面的内存布局就很清楚了，那是相当复杂，其中出现了各种偏移，简单了解下就行了，如果不是维护老代码，谁现在还写这样的结构。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CSuper</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func0</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase0</span> :</span> <span class="keyword">virtual</span> <span class="keyword">public</span> CSuper</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var0;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CBase1</span> :</span> <span class="keyword">virtual</span> <span class="keyword">public</span> CSuper</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var1;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">CDerived</span> :</span> <span class="keyword">public</span> CBase0, <span class="keyword">public</span> CBase1</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="keyword">int</span> m_var2;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class CSuper    size(8):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | m_var</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CSuper::$vftable@:</span><br><span class="line"><span class="number">1</span>&gt;      | &amp;CSuper_meta</span><br><span class="line"><span class="number">1</span>&gt;      |  <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &amp;CSuper::func0</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">1</span>  | &amp;CSuper::func1</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;  CSuper::func0 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;  CSuper::func1 <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line">1&gt;  class CBase0    size(20):</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">0</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">4</span>  | &#123;vbptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;   <span class="number">8</span>  | m_var0</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;      +--- (<span class="keyword">virtual</span> base CSuper)</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">12</span>  | &#123;vfptr&#125;</span><br><span class="line"><span class="number">1</span>&gt;  <span class="number">16</span>  | m_var</span><br><span class="line"><span class="number">1</span>&gt;      +---</span><br><span class="line"><span class="number">1</span>&gt;</span><br><span class="line